pages/Math/angle_bisector/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vector Angle Bisector</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
                     <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.10.0/dist/katex.min.css" integrity="sha384-9eLZqc9ds8eNjO3TmqPeYcDj8n+Qfa4nuSiGYa6DjLNcv9BtN69ZIulL9+8CqC9Y" crossorigin="anonymous"/>


</head>
<body>
    <header>
      <h1> <a href="https://ianstranathan.github.io/">Ian Stranathan </a></h1>
      <p> Noodling around: Graphics | Game Development | Physics | Math <p>
	<nav>
	  <ul>
	    <li><a href="https://ianstranathan.github.io/pages/Misc/about/"><i class="fa-regular fa-address-card"></i></a></li>
	    <li><a href="mailto:ian@wabisoft.io"><i class="fa fa-envelope" aria-hidden="true"></i></a></li>
	    <li><a href="https://github.com/ianstranathan"><i class="fa-brands fa-github"></i></a></li>
	  </ul>
	</nav>
    </header>
<div id="content">
<p>
This is a reference derivation for the halfway vector used in the Blinn-Phong lighting model, See article <a href="../../Graphics/halfway_vector/index.html">here</a>
</p>

<p>
Given two vectors \(\vec a\) and \(\vec b\) with angle \(\theta\) between them
</p>

<p>
let a bisecting vector be
</p>

<p>
\[
\xi = \lvert \lvert \vec a \rvert \rvert \vec b + \lvert \lvert \vec b \rvert \rvert \vec a
\]
</p>

<p>
Here is a helpful <a href="https://www.desmos.com/calculator/flokdplftr">desmos visualization</a>
</p>

<p>
This is rather arbitrarily presented, but if you construct it for yourself, 
you'll see the geometric motivation for the expression in the parallelogram it forms.
</p>

<p>
If you're satisfied by this, remembering properties of parallelograms, then you can stop here.
</p>

<p>
Algebraically showing that the angles are the same is pretty straightforward:
</p>

<p>
An expression for each of the angles (let's say \(\theta_1\) is the angle between
\(\vec a\) and \(\xi\) and \(\theta_2\) is the angle between \(\vec b\) and \(\xi\)) can be given by the dot
product:
</p>

<p>
by definition of dot product:
</p>

<p>
\[\cos \left( \theta_1  \right) = \frac 
    {\vec a \cdot \vec \xi}
    {\lvert \lvert \vec a \rvert \rvert \lvert \lvert \vec \xi \rvert \rvert}
    \]
</p>

<p>
\[\cos \left( \theta_2  \right) = \frac {\vec b \cdot \vec \xi}{\lvert \lvert \vec b \rvert \rvert \lvert \lvert \vec \xi \rvert \rvert}\]
</p>

<p>
Looking at the expression for \(\theta_1\) and substituting in our expression for \(\xi\)
</p>

<p>
\[\cos \left( \theta_1  \right) = \frac 
    {\vec a \cdot
    \left(
    \lvert \lvert \vec a \rvert \rvert \vec b + \lvert \lvert \vec b \rvert \rvert \vec a
    \right)}
    {\lvert \lvert \vec a \rvert \rvert \lvert \lvert \vec \xi \rvert \rvert}
    \]
</p>

<p>
\(\implies\) (by properties of dot products):
</p>

<p>
\[\cos \left( \theta_1  \right) = \frac{\vec a \cdot \vec b \lvert \lvert \vec a \rvert \rvert + \lvert \lvert \vec b \rvert \rvert 
{\lvert \lvert \vec a \rvert \rvert}^2
}
{
\lvert \lvert \vec a \rvert \rvert \lvert \lvert \vec \xi \rvert \rvert
} 
\]
</p>

<p>
\(\implies\) (simplifying):
</p>

<p>
\[\cos \left( \theta_1  \right) = \frac{\vec a \cdot \vec b + \lvert \lvert \vec b \rvert \rvert 
\lvert \lvert \vec a \rvert \rvert
}
{
\lvert \lvert \vec \xi \rvert \rvert
} 
\]
</p>

<p>
both original cosine expressions are identical up to swapping \(\vec a\) &amp; \(\vec b\)
</p>

<p>
Thus, repeating the process for \(\theta_2\) will yield the same expression
</p>

<p>
Cosine is an even function \(\implies \cos \alpha = \cos \left( -\alpha \right)\)
</p>


<p>
\(\theta_1 = \theta_2\) or \(\theta_1 = -\theta_2\)
</p>


<p>
Either way, they're the same scalar and our expression \(\xi\) is the true bisecting vector.
</p>

<hr />

<p>
See <a href="https://proofwiki.org/wiki/Angle_Bisector_Vector">Proof Wiki</a> for more
</p>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p>
</div>
    <footer>
      <p>©Ian Stranathan <script>document.write(new Date().getFullYear())</script></p>
    </footer>
  </body>
